{
  "started": 2023,
  "achievements": [
    {
      "title": "Introduction to Programming",
      "description": "Began learning programming at age 11, starting with Scratch and progressing to C++ as the first formal programming language."
    },
    {
      "title": "Proficiency in Multiple Programming Languages",
      "description": "Gained proficiency in Python, C++, JavaScript, Java, and more. Developed skills in logic building, object-oriented programming, memory management, and web development.",
      "link": "/about/#skills"
    },
    {
      "title": "Completed Digi Navigator 4",
      "description": "Successfully completed Digi Navigator 4, a UK curriculum-based course focusing on foundational digital literacy and programming skills."
    },
    {
      "title": "Province-Level Coding Competition Winner",
      "description": "Achieved first place in a province-level coding and animation competition organized by Cannon Secondary School and Digi School in 2025.",
      "link": "/about/#hktn"
    },
    {
      "title": "Chess Game Project",
      "description": "Developed a fully functional chess game using Python and Pygame, implementing all game logic from scratch without external libraries.",
      "link": "/projects/#chess"
    },
    {
      "title": "Completed Digi Trailblazer-1",
      "description": "Completed the Trailblazer-1 course, gaining foundational knowledge in Python programming, cybersecurity basics, and introductory IoT concepts."
    },
    {
      "title": "Machine Learning Project",
      "description": "Created a basic machine learning project capable of recognizing handwritten digits and converting them into digital format, applying fundamental ML techniques.",
      "link": "/projects/#mling"
    },
    {
      "title": "Full-Stack Web Development Course Creation",
      "description": "Designed and developed a beginner-focused full-stack web development course for the ICT Club at NJBS, emphasizing self-learning and practical application.",
      "link": "/projects/#webdev"
    }
  ]
}
